import React from "react";
import FadeInLetters from "../components/Letters/FadeInLetters";

const CareerPage = () => {
    
  return (
    <FadeInLetters>
      LifeStory 안녕하세요 저는 프론트엔드 개발자 한태영입니다. 어릴때부터
      호기심이 많아 바다와 산, 들판으로 돌아다니며 곤충채집을 하거나 동물들을
      구경했습니다. 자연스럽게 수학과 과학을 좋아하게 되었고 집에 있는 책이나
      도서관에 있는 책을 읽게 되었습니다. 중학생때는 철학과 영어에 관심이
      많아져서 무엇이 정의인가? 옳고 그른것 등등에 대해 깊이 생각하고 탐구하게
      되었습니다. 고등학생이 되어 피아노를 치고 싶어져서 피아노를 열심히
      하였습니다. 대학생이 되어 미래에 대한 고민을 하던 중 프로그래밍을 하겠다고
      마음을 먹고 2014년 처음으로 프로그래밍을 하겠다고 마음을 먹은 이후
      프로그래머로 일을 하고 있습니다. C를 처음 공부한 이후 , 자바를 거쳐 게임을
      만들기 위해 유니티를 배우고 C#을 하였습니다. 스팀에 게임을 개발하여 출시한
      후, 컴퓨터 과학에 대한 기반지식을 탄탄히 해야겠다고 느껴서 1년 반 정도
      알고리즘, 자료구조, 운영체제, 등을 공부하며 프로그래밍 대회에 여러 번
      참가했습니다. 그 후 프론트엔드 분야에서 최신기술과 디자인이 결합된 것이
      저랑 잘 맞는다고 느껴서 프론트엔드 개발자로서의 길을 가기로 마음을
      먹었습니다. 최근 객체지향을 넘어 함수형 프로그래밍의 장점을 느끼고
      있습니다. 1인 게임개발 2년 1인 웹 개발 1년 태양광 회사 근무 2개월
    </FadeInLetters>
  );
};

export default CareerPage;
